In [9]:
import pandas as pd
import numpy as np
df = pd.read_excel('score.xlsx',index_col='지원번호')

In [10]:
## 그룹화

# 해당되는 그룹의 리스트를 보여줌 (get_group)
df.groupby('학교').get_group('구로고')

# 해당 학교 학생 수 확인
df.groupby('학교').size()
df.groupby('학교').size()['구로고']
df.groupby('학교').size()['디지털고']

# 해당 학교 별 리스트 개수 확인
df.groupby('학교').count()

# 학교 별 키 평균값 출력
df.groupby('학교')['키'].mean()

학교
구로고     184.800000
디지털고    193.333333
Name: 키, dtype: float64

그룹별로 합계, 평균, 최대값

In [11]:
# 컬럼별 최대값, 최소값, 평균, 합계, 표준편차
df['키'].mean()

np.float64(188.0)

In [12]:
df.groupby('학교')['키'].mean()

학교
구로고     184.800000
디지털고    193.333333
Name: 키, dtype: float64

In [13]:
# 컬럼을 추가
df['학년'] = [3,3,2,1,3,2,2,1]
df

       이름    학교    키   국어   영어   수학  과학  사회        SW특기  학년
지원번호
1번    강나래   구로고  197   90   85  100  95  85      Python   3
2번    강태원   구로고  184   40   35   50  55  25        Java   3
3번    강호림   구로고  168   80   75   70  80  75  Javascript   2
4번    김수찬   구로고  187   40   60   70  75  80         NaN   1
5번    김재욱   구로고  188   15   20   10  35  10         NaN   3
6번    박동현  디지털고  202   80  100   95  85  80           C   2
7번    박혜정  디지털고  188   55   65   45  40  35      PYTHON   2
8번    승근열  디지털고  190  100   85   90  95  95          C#   1

In [14]:
df.groupby('학교')['이름','SW특기'].count()

ValueError: Cannot subset columns with a tuple with more than one element. Use a list instead.

In [ ]:
df.groupby('학년').count()

    이름  학교  키  국어  영어  수학  과학  사회  SW특기
학년
1    2   2  2   2   2   2   2   2     1
2    3   3  3   3   3   3   3   3     3
3    3   3  3   3   3   3   3   3     2

In [ ]:
df.groupby('학년').sum().sort_values('키')
df.groupby('학교')['키'].max()

학교
구로고     197
디지털고    202
Name: 키, dtype: int64

In [ ]:
## 그,룹화 : 
# 컬럼을 기준으로 그룹핑 - df.groupby('컬럼') | sum() : 합계 / count() : 개수 / size() : 크기
df.groupby('학교').count()
df.groupby(['학교','학년']).count()


# df.groupby('컬럼')['숫자타입컬럼'] | mean, max, min 등 값을 낼 수 없는 값이 있으면 에러남 
# 하지만 값을 낼 수 있는 컬럼을 지정해주면 출력됨
df.groupby('학교')['키'].mean()
df.groupby('학교')[['키','국어']].min()

# 그룹별 키로 정렬, 역순정렬
df.groupby('학년')['키'].mean().sort_values(ascending=False)

학년
3    189.666667
1    188.500000
2    186.000000
Name: 키, dtype: float64

In [ ]:
# 학교로 그룹핑 > 학년으로 학생 수 출력
## 그룹핑을 했을 때 사용되는 개수
df.groupby('학교')['학년'].value_counts()

학교    학년
구로고   3     3
      1     1
      2     1
디지털고  2     2
      1     1
Name: count, dtype: int64

In [ ]:
### 학교로 그룹핑 > 학년으로 학생 수 출력 > 구로고 학생에 대한 것만 출력
df.groupby('학교')['학년'].value_counts().loc['구로고']

# 퍼센트로 출력됨 : normalize = True
df.groupby('학교')['학년'].value_counts(normalize=True).loc['구로고']

학년
3    0.6
1    0.2
2    0.2
Name: proportion, dtype: float64

In [ ]:
# 구로고 학생의 키의 합계
df.groupby('학교')['키'].sum().loc['구로고']

NameError: name 'df' is not defined

In [16]:
df.groupby('학교')['키'].mean()
df.groupby('학교')['키'].min()
df.groupby('학교')['키'].max()
df.groupby('학교')['키'].sum()
df.groupby('학교')['키'].agg(['mean','min','max','sum'])

            mean  min  max  sum
학교
구로고   184.800000  168  197  924
디지털고  193.333333  188  202  580